RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_u7816.h
/**
  *******************************************************************************************************
  * @file    fm33lg0xx_fl_u7816.h
  * @author  FMSH Application Team
  * @brief   Head file of U7816 FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2021] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under Mulan PSL v2.
  * You can use this software according to the terms and conditions of the Mulan PSL v2.
  * You may obtain a copy of Mulan PSL v2 at:
  *          http://license.coscl.org.cn/MulanPSL2
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
  * EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
  * MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
  * See the Mulan PSL v2 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LG0XX_FL_U7816_H
#define __FM33LG0XX_FL_U7816_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lg0xx_fl_def.h"
/** @addtogroup FM33LG0XX_FL_Driver
  * @{
  */

/** @defgroup U7816 U7816
  * @brief U7816 FL driver
  * @{
  */

/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup U7816_FL_ES_INIT U7816 Exported Init structures
  * @{
  */

/**
  * @brief FL U7816 Init Sturcture definition
  */
typedef struct
{
    /*! 卡时钟频率 */
    uint32_t outputClockFrequency;
    /*! 接口发送失败后自动重装使能 */
    uint32_t txAutoRetry;
    /*! 自动重装次数 */
    uint32_t retryCnt;
    /*!插入BGT使能 */
    uint32_t blockGuard;
    /*! 帧格式奇偶校验模式 */
    uint32_t parity;
    /*! 帧格式接收Guard时间 */
    uint32_t rxGuardTime;
    /*! 帧格式错误Guard时间 */
    uint32_t errorGuardTime;
    /*! 帧错误信号长度 */
    uint32_t errorSignalWidth;
    /*! 接收校验错误自动回发error signal使能 */
    uint32_t rxAutoErrorSignal;
    /*! 传输BIT顺序 */
    uint32_t transferOrder;
    /*! 通讯速率 */
    uint32_t baud;
    /*! 额外发送Guard时间 */
    uint32_t extraGuardTime;

} FL_U7816_InitTypeDef;


/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup U7816_FL_Exported_Constants U7816 Exported Constants
  * @{
  */

#define    U7816_CR_TXEN_Pos                                      (5U)
#define    U7816_CR_TXEN_Msk                                      (0x1U << U7816_CR_TXEN_Pos)
#define    U7816_CR_TXEN                                          U7816_CR_TXEN_Msk

#define    U7816_CR_RXEN_Pos                                      (4U)
#define    U7816_CR_RXEN_Msk                                      (0x1U << U7816_CR_RXEN_Pos)
#define    U7816_CR_RXEN                                          U7816_CR_RXEN_Msk

#define    U7816_CR_CKOEN_Pos                                     (3U)
#define    U7816_CR_CKOEN_Msk                                     (0x1U << U7816_CR_CKOEN_Pos)
#define    U7816_CR_CKOEN                                         U7816_CR_CKOEN_Msk

#define    U7816_FFR_ERSW_Pos                                     (9U)
#define    U7816_FFR_ERSW_Msk                                     (0x3U << U7816_FFR_ERSW_Pos)
#define    U7816_FFR_ERSW                                         U7816_FFR_ERSW_Msk

#define    U7816_FFR_ERSGD_Pos                                    (8U)
#define    U7816_FFR_ERSGD_Msk                                    (0x1U << U7816_FFR_ERSGD_Pos)
#define    U7816_FFR_ERSGD                                        U7816_FFR_ERSGD_Msk

#define    U7816_FFR_BGTEN_Pos                                    (7U)
#define    U7816_FFR_BGTEN_Msk                                    (0x1U << U7816_FFR_BGTEN_Pos)
#define    U7816_FFR_BGTEN                                        U7816_FFR_BGTEN_Msk

#define    U7816_FFR_REP_T_Pos                                    (6U)
#define    U7816_FFR_REP_T_Msk                                    (0x1U << U7816_FFR_REP_T_Pos)
#define    U7816_FFR_REP_T                                        U7816_FFR_REP_T_Msk

#define    U7816_FFR_PAR_Pos                                      (4U)
#define    U7816_FFR_PAR_Msk                                      (0x3U << U7816_FFR_PAR_Pos)
#define    U7816_FFR_PAR                                          U7816_FFR_PAR_Msk

#define    U7816_FFR_RFREN_Pos                                    (3U)
#define    U7816_FFR_RFREN_Msk                                    (0x1U << U7816_FFR_RFREN_Pos)
#define    U7816_FFR_RFREN                                        U7816_FFR_RFREN_Msk

#define    U7816_FFR_TREPEN_Pos                                   (2U)
#define    U7816_FFR_TREPEN_Msk                                   (0x1U << U7816_FFR_TREPEN_Pos)
#define    U7816_FFR_TREPEN                                       U7816_FFR_TREPEN_Msk

#define    U7816_FFR_RREPEN_Pos                                   (1U)
#define    U7816_FFR_RREPEN_Msk                                   (0x1U << U7816_FFR_RREPEN_Pos)
#define    U7816_FFR_RREPEN                                       U7816_FFR_RREPEN_Msk

#define    U7816_FFR_DICONV_Pos                                   (0U)
#define    U7816_FFR_DICONV_Msk                                   (0x1U << U7816_FFR_DICONV_Pos)
#define    U7816_FFR_DICONV                                       U7816_FFR_DICONV_Msk

#define    U7816_IER_RXIE_Pos                                     (2U)
#define    U7816_IER_RXIE_Msk                                     (0x1U << U7816_IER_RXIE_Pos)
#define    U7816_IER_RXIE                                         U7816_IER_RXIE_Msk

#define    U7816_IER_TXIE_Pos                                     (1U)
#define    U7816_IER_TXIE_Msk                                     (0x1U << U7816_IER_TXIE_Pos)
#define    U7816_IER_TXIE                                         U7816_IER_TXIE_Msk

